{
    "command-line": "@SUMA_Make_Spec_SF [HELP] [DEBUG] [SFPATH] [SID]",
    "description": "tool description",
    "inputs": [
        {
            "command-line-flag": "-help",
            "description": "show this help information",
            "id": "HELP",
            "name": "HELP",
            "optional": true,
            "type": "String",
            "value-key": "[HELP]"
        },
        {
            "command-line-flag": "-debug",
            "description": "print debug information along the way e.g. -debug 1 the default level is 0, max is 2",
            "id": "DEBUG",
            "name": "DEBUG",
            "optional": true,
            "type": "String",
            "value-key": "[DEBUG]"
        },
        {
            "command-line-flag": "-sfpath",
            "description": "path to directory containing 'SURFACES' and AFNI volume used in creating the surfaces. e.g. -sfpath subject1/surface_models the default PATH value is './', the current directory  This is generally the location of the 'SURFACES' directory, though having PATH end in SURFACES is OK.  Note: when this option is provided, all file/path messages will be with respect to this directory.",
            "id": "SFPATH",
            "name": "SFPATH",
            "optional": true,
            "type": "String",
            "value-key": "[SFPATH]"
        },
        {
            "command-line-flag": "-sid",
            "description": "required subject ID for file naming   notes:  0. More help may be found at https://afni.nimh.nih.gov/ssc/ziad/SUMA/SUMA_doc.htm 1. Surface file names should look like the standard names used by SureFit: rw_1mmLPI.L.full.segment_vent_corr.fiducial.58064.coord Otherwise the script cannot detect them. You will need to decide which surface is the most recent (the best) and the script helps you by listing the available surfaces with the most recent one first. This sorting ususally works except when the time stamps on the surface files are messed up. In such a case you just need to know which one to use. Once the fiducial surface is chosen, it's complimentary surfaces are selected using the node number in the file name. 3. You can tailor the script to your needs. Just make sure you rename it or risk having your modifications overwritten with the next SUMA version you install.  R. Reynolds (rickr@codon.nih.gov), Z. Saad (saadz@mail.nih.gov)",
            "id": "SID",
            "name": "SID",
            "optional": true,
            "type": "String",
            "value-key": "[SID]"
        }
    ],
    "name": "tool name",
    "schema-version": "0.5",
    "suggested-resources": {
        "cpu-cores": 1,
        "ram": 1,
        "walltime-estimate": 60
    },
    "tags": {},
    "tool-version": "v0.1.0"
}