{
    "command-line": "tfim [PREFIX] [PTHRESH] [EQCORR] [PAIRED] [...]",
    "description": "tool description",
    "inputs": [
        {
            "command-line-flag": "-prefix",
            "description": "'pname' is used as the prefix for the output filenames.  The output image files are + pname.diff = average of set2 minus average of set1 (or minus 'bval') + pname.tspm = t-statistic of difference Output images are in the 'flim' (floating pt. image) format, and may be converted to 16 bit shorts using the program 'ftosh'. *** The default 'pname' is 'tfim', if -prefix isn't used.",
            "id": "PREFIX",
            "name": "PREFIX",
            "optional": true,
            "type": "String",
            "value-key": "[PREFIX]"
        },
        {
            "command-line-flag": "-pthresh",
            "description": "'pval' is a numeric value between 0 and 1, giving the significance level (per voxel) to threshold the output with; voxels with (2-sided) t-statistic less significant than 'pval' will have their diff output zeroed. *** The default is no threshold, if -pthresh isn't used.",
            "id": "PTHRESH",
            "name": "PTHRESH",
            "optional": true,
            "type": "String",
            "value-key": "[PTHRESH]"
        },
        {
            "command-line-flag": "-eqcorr",
            "description": "If present, this option means to write out the file pname.corr = equivalent correlation statistic =  t/sqrt(dof+t^2) The number 'dval' is the value to use for 'dof' if dval is positive.  This would typically be the total number of data images used in forming the image sets, if the image sets are from sfim or fim. If dval is zero, then dof is computed from the number of images in -set1 and -set2; if these are averages from program sfim, then dof will be smallish, which in turn means that significant corr values will be higher than you may be used to from using program fim. *** The default is not to write, if -eqcorr isn't used.",
            "id": "EQCORR",
            "name": "EQCORR",
            "optional": true,
            "type": "String",
            "value-key": "[EQCORR]"
        },
        {
            "command-line-flag": "-paired",
            "description": "If present, this means that -set1 and -set2 should be compared using a paired sample t-test.  This option is illegal with the -base1 option.  The number of samples in the two sets of images must be equal. [This test is implemented by subtracting -set1 images from the -set2 images, then testing as in '-base1 0'.] *** The default is to do an unpaired test, if -paired isn't used.  In that case, -set1 and -set2 don't need to have the same number of images.",
            "id": "PAIRED",
            "name": "PAIRED",
            "optional": true,
            "type": "String",
            "value-key": "[PAIRED]"
        },
        {
            "description": "NA",
            "id": "...",
            "name": "...",
            "optional": false,
            "type": "String",
            "value-key": "[...]"
        }
    ],
    "name": "tool name",
    "schema-version": "0.5",
    "suggested-resources": {
        "cpu-cores": 1,
        "ram": 1,
        "walltime-estimate": 60
    },
    "tags": {},
    "tool-version": "v0.1.0"
}